/**
 * Created by lz on 2018/5/30.
 */
//在这里存放一些通用的数据
    //标准正态分布表
var tab_nnd=[[0.5,0.503989356,0.507978314,0.511966473,0.515953437,0.519938806,0.523922183,0.52790317,0.531881372,0.535856393]
,[0.539827837,0.543795313,0.547758426,0.551716787,0.555670005,0.559617692,0.563559463,0.567494932,0.571423716,0.575345435]
    ,[0.579259709,0.583166163,0.587064423,0.590954115,0.594834872,0.598706326,0.602568113,0.606419873,0.610261248,0.614091881]
    ,[0.617911422,0.621719522,0.625515835,0.629300019,0.633071736,0.636830651,0.640576433,0.644308755,0.648027292,0.651731727]
    ,[0.655421742,0.659097026,0.662757273,0.666402179,0.670031446,0.67364478,0.67724189,0.680822491,0.684386303,0.687933051]
    ,[0.691462461,0.694974269,0.698468212,0.701944035,0.705401484,0.708840313,0.712260281,0.715661151,0.719042691,0.722404675]
    ,[0.725746882,0.729069096,0.732371107,0.735652708,0.7389137,0.742153889,0.745373085,0.748571105,0.75174777,0.754902906]
    ,[0.758036348,0.761147932,0.764237502,0.767304908,0.770350003,0.773372648,0.776372708,0.779350054,0.782304562,0.785236116]
    ,[0.788144601,0.791029912,0.793891946,0.796730608,0.799545807,0.802337457,0.805105479,0.807849798,0.810570345,0.813267057]
    ,[0.815939875,0.818588745,0.82121362,0.823814458,0.82639122,0.828943874,0.831472393,0.833976754,0.836456941,0.83891294]
    ,[0.841344746,0.843752355,0.84613577,0.848494997,0.85083005,0.853140944,0.8554277,0.857690346,0.85992891,0.862143428]
    ,[0.864333939,0.866500487,0.868643119,0.870761888,0.872856849,0.874928064,0.876975597,0.878999516,0.880999893,0.882976804]
    ,[0.88493033,0.886860554,0.888767563,0.890651448,0.892512303,0.894350226,0.896165319,0.897957685,0.899727432,0.901474671]
    ,[0.903199515,0.904902082,0.906582491,0.908240864,0.909877328,0.911492009,0.913085038,0.914656549,0.916206678,0.917735561]
    ,[0.919243341,0.920730159,0.922196159,0.92364149,0.9250663,0.92647074,0.927854963,0.929219123,0.930563377,0.931887882]
    ,[0.933192799,0.934478288,0.935744512,0.936991636,0.938219823,0.939429242,0.940620059,0.941792444,0.942946567,0.944082597]
    ,[0.945200708,0.946301072,0.947383862,0.948449252,0.949497417,0.950528532,0.951542774,0.952540318,0.953521342,0.954486023]
    ,[0.955434537,0.956367063,0.957283779,0.958184862,0.959070491,0.959940843,0.960796097,0.96163643,0.96246202,0.963273044]
    ,[0.964069681,0.964852106,0.965620498,0.966375031,0.967115881,0.967843225,0.968557237,0.969258091,0.969945961,0.97062102]
    ,[0.97128344,0.971933393,0.97257105,0.973196581,0.973810155,0.97441194,0.975002105,0.975580815,0.976148236,0.976704532]
    ,[0.977249868,0.977784406,0.978308306,0.97882173,0.979324837,0.979817785,0.98030073,0.980773828,0.981237234,0.9816911]
    ,[0.982135579,0.982570822,0.982996977,0.983414193,0.983822617,0.984222393,0.984613665,0.984996577,0.985371269,0.985737882]
    ,[0.986096552,0.986447419,0.986790616,0.987126279,0.987454539,0.987775527,0.988089375,0.988396208,0.988696156,0.988989342]
    ,[0.98927589,0.989555923,0.989829561,0.990096924,0.99035813,0.990613294,0.990862532,0.991105957,0.991343681,0.991575814]
    ,[0.991802464,0.99202374,0.992239746,0.992450589,0.992656369,0.992857189,0.993053149,0.993244347,0.993430881,0.993612845]
    ,[0.993790335,0.993963442,0.994132258,0.994296874,0.994457377,0.994613854,0.994766392,0.994915074,0.995059984,0.995201203]
    ,[0.995338812,0.995472889,0.995603512,0.995730757,0.995854699,0.995975411,0.996092967,0.996207438,0.996318892,0.996427399]
    ,[0.996533026,0.99663584,0.996735904,0.996833284,0.996928041,0.997020237,0.997109932,0.997197185,0.997282055,0.997364598]
    ,[0.99744487,0.997522925,0.997598818,0.9976726,0.997744323,0.997814039,0.997881795,0.997947641,0.998011624,0.998073791]
    ,[0.998134187,0.998192856,0.998249843,0.99830519,0.998358939,0.99841113,0.998461805,0.998511001,0.998558758,0.998605113]
    ,[0.998650102,0.998693762,0.998736127,0.998777231,0.998817109,0.998855793,0.998893315,0.998929706,0.998964997,0.998999218]
];
//地区块地形元素分布表
var beta_2326=((23+26/60)/180)*Math.PI;//南北回归线弧度
var beta_6034=((60+34/60)/180)*Math.PI;//南北极圈弧度
var beta_8=((8)/180)*Math.PI;//赤道附近弧度
var tab_landtypedqk={//rate按从小到大排列生成的随机数小于哪个就定为何种地形，effect在卷积平滑阶段起作用，表示这个地形对周围环境的影响程度
    "热带海洋":{eval:"height<0&&rate_land<0.9&&Math.abs(beta)<beta_2326","热带海洋dqk":{rate:1,effect:1}},//eval是判断地区块大类型的判断条件，以后在设计技能效果时也可能要借鉴这里
    "温带海洋":{eval:"height<0&&rate_land<0.9&&Math.abs(beta)>beta_2326&&Math.abs(beta)<beta_6034","温带海洋dqk":{rate:1,effect:1}},
    "寒带海洋":{eval:"height<0&&rate_land<0.9&&Math.abs(beta)>beta_6034","寒带海洋dqk":{rate:1,effect:1}},
    "温带1500米以下":{eval:"rate_land>0.1&&Math.abs(beta)>beta_2326&&Math.abs(beta)<beta_6034&&height<1500","草原dqk":{rate:0.4,effect:1},"森林dqk":{rate:0.4,effect:1},"戈壁dqk":{rate:0.2,effect:2}},
    "温带1500米以上":{eval:"rate_land>0.1&&Math.abs(beta)>beta_2326&&Math.abs(beta)<beta_6034&&height>=1500","雪山dqk":{rate:1,effect:1}},
    "亚热带3000米以下":{eval:"rate_land>0.1&&Math.abs(beta)>beta_8&&Math.abs(beta)<beta_2326&&height<3000","热带雨林dqk":{rate:0.5,effect:1},"稀树草原dqk":{rate:0.5,effect:1}},
    "亚热带3000米以上":{eval:"rate_land>0.1&&Math.abs(beta)>beta_8&&Math.abs(beta)<beta_2326&&height>=3000","雪山dqk":{rate:1,effect:1}},
    "热带3000米以下":{eval:"rate_land>0.1&&Math.abs(beta)<beta_8&&height<3000","热带雨林dqk":{rate:0.5,effect:1},"沙漠dqk":{rate:0.5,effect:2}},
    "热带3000米以上":{eval:"rate_land>0.1&&Math.abs(beta)<beta_8&&height>=3000","雪山dqk":{rate:1,effect:1}},
    "寒带-100米以下":{eval:"rate_land>0.1&&Math.abs(beta)>beta_6034&&height<-100","草原dqk":{rate:0.4,effect:1},"森林dqk":{rate:0.4,effect:1},"戈壁dqk":{rate:0.2,effect:2}},
    "寒带-100到200米以内":{eval:"rate_land>0.1&&Math.abs(beta)>beta_6034&&height<200&&height>=-100","寒带森林dqk":{rate:0.6,effect:1},"冰川dqk":{rate:0.4,effect:1}},
    "寒带200米以上":{eval:"rate_land>0.1&&Math.abs(beta)>beta_6034&&height>200","冰川dqk":{rate:1,effect:1}}
}
var tab_landtypedqk2={//每一种地区块的远观颜色和内部地貌快（单位块？）占比
    "默认dqk":{color:[250,126,126],content:{"红白格dmk":{rate:1,effect:0}}},//完全红白格,这种表示错误和未定义的地貌块不会影响周围
    "热带海洋dqk":{color:[15,63,105],content:{"海洋水面dmk":{rate:0.99,effect:1},"雨林dmk":{rate:0.995,effect:0},"沙滩dmk":{rate:1,effect:0}}},
    "温带海洋dqk":{color:[15,63,105],content:{"海洋水面dmk":{rate:0.99,effect:1},"森林dmk":{rate:0.995,effect:0},"沙滩dmk":{rate:1,effect:0}}},
    "寒带海洋dqk":{color:[15,63,105],content:{"海洋水面dmk":{rate:0.5,effect:1},"冰面dmk":{rate:1,effect:1}}},
    "草原dqk":{color:[93, 153, 63],content:{"草地dmk":{rate:0.95,effect:1},"内陆水面dmk":{rate:1,effect:1}}},
    "森林dqk":{color:[33,68,44],content:{"森林dmk":{rate:0.95,effect:1},"内陆水面dmk":{rate:1,effect:1}}},
    "戈壁dqk":{color:[127, 102, 79],content:{"戈壁dmk":{rate:1,effect:1}}},
    "雪山dqk":{color:[220, 221, 220],content:{"雪地dmk":{rate:0.8,effect:1},"岩石dmk":{rate:1,effect:0}}},
    "热带雨林dqk":{color:[33,68,44],content:{"雨林dmk":{rate:0.95,effect:1},"内陆水面dmk":{rate:1,effect:1}}},
    "稀树草原dqk":{color:[117, 118, 68],content:{"稀树草原dmk":{rate:0.95,effect:1},"内陆水面dmk":{rate:1,effect:1}}},
    "沙漠dqk":{color:[175, 117, 68],content:{"沙地dmk":{rate:0.99,effect:1},"内陆水面dmk":{rate:0.995,effect:0},"绿洲dmk":{rate:1,effect:0}}},
    "寒带森林dqk":{color:[],content:{"寒带森林dmk":{rate:0.85,effect:1},"雪地dmk":{rate:1,effect:1}}},
    "冰川dqk":{color:[201, 216, 220],content:{"冰面dmk":{rate:0.85,effect:1},"雪地dmk":{rate:1,effect:1}}}
}
var tab_landtypedmk={//每一种地貌块的纹理url
    "红白格dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/amiga.jpg",color:[250,126,126]},//对单位的影响，纹理Url，纹理的平均颜色
    "海洋水面dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/sea.png",color:[15,63,105]},
    "雨林dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/yulin.png",color:[33,68,44]},
    "沙滩dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/shatan.png",color:[205, 160, 109]},
    "森林dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/yulin.png",color:[33,68,44]},//没找到温带森林，暂时用雨林代替
    "冰面dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/ice.png",color:[201, 216, 220]},
    "草地dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/grass.png",color:[93, 153, 63]},
    "内陆水面dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/lake.png",color:[93,143,180]},
    "戈壁dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/gebi.png",color:[127, 102, 79]},
    "雪地dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/snow.png",color:[220, 221, 220]},
    "岩石dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/stone.png",color:[82, 81, 74]},
    "稀树草原dmk":{eval_effect:"../../ASSETS/IMAGE/Texture_landtypedmk/xishucaoyuan.png",Url:"",color:[117, 118, 68]},
    "沙地dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/sand.png",color:[175, 117, 68]},
    "绿洲dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/lvzhou.png",color:[127, 144, 111]},
    "寒带森林dmk":{eval_effect:"",Url:"../../ASSETS/IMAGE/Texture_landtypedmk/lvzhou.png",color:[127, 144, 111]}

}